/**
 * Created by vanki on 2017/2/21.
 */

/**
 * 后台返回CODE
 * @type {{CODE_200: [*], CODE_201: [*], CODE_400: [*], CODE_500: [*], CODE_501: [*], CODE_600: [*], CODE_601: [*], CODE_602: [*], CODE_603: [*], CODE_610: [*], CODE_611: [*], CODE_612: [*], CODE_613: [*], CODE_1001: [*], CODE_1002: [*], CODE_1003: [*], CODE_1004: [*], CODE_1010: [*], CODE_1011: [*], CODE_1012: [*], CODE_1013: [*], CODE_1013: [*]}}
 */
var ConstStatusCode = {
    CODE_200: [200, "成功"],
    CODE_201: [201, "请先登录"],
    CODE_400: [400, "参数错误"],
    CODE_500: [500, "系统错误"],
    CODE_501: [501, "系统异常"],

    CODE_600: [600, "未选择文件"],
    CODE_601: [600, "文件过大"],
    CODE_602: [602, "不支持的资源类型"],
    CODE_603: [603, "上传失败"],

    CODE_610: [610, "数据操作失败"],
    CODE_611: [611, "请勿操作他人数据"],

    CODE_612: [612, "数据不存在"],
    CODE_613: [613, "上级数据不存在"],

    CODE_620: [620, "验证码错误"],

    CODE_630: [630, "未找到上传图片"],
    CODE_631: [631, "图片上传数量过多，请分批上传"],

    CODE_1001: [1001, "密码长度不符"],
    CODE_1002: [1002, "用户名长度不符"],
    CODE_1003: [1003, "用户昵称长度不符"],
    CODE_1004: [1004, "密码错误"],

    CODE_1010: [1010, "用户已存在"],
    CODE_1011: [1011, "用户不存在"],
    CODE_1012: [1012, "用户名请包含字母和数字"],
    CODE_1013: [1013, "手机号已存在"],
    CODE_1014: [1014, "手机号不存在"],

    CODE_1100: [1100, "密码错误"],
    CODE_1101: [1101, "导出失败，笔记内容为空"],
    CODE_1102: [1102, "标题过长"],
}